app/controllers/admin/events_controller.rb

SELECT * FROM "events"
---
  def index
    @events = Event.all

INSERT INTO "events" ("name", "address", "created_at", "updated_at", "description") VALUES('evento', 'direccion', '2010-08-31 07:23:02', '2010-08-31 07:23:02', 'descripcion')
SELECT * FROM "talks" WHERE ("talks"."id" = '2') LIMIT 1
UPDATE "talks" SET "updated_at" = '2010-08-31 07:23:02', "event_id" = 3 WHERE "id" = 2
---
  def create
    @event = Event.new(params[:event])
    @ids=params[:ids]
    @ids.each do |id|
      @event.talks<<Talk.find_by_id(id)
    end

    respond_to do |format|
      if @event.save

SELECT * FROM "events" WHERE ("events"."id" = 1)
UPDATE "events" SET "updated_at" = '2010-09-02 08:00:15', "name" = 'Conferencia Rail', "address" = 'Oviedo', "description" = 'Los mayores expertos compartiendo su sabiduría' WHERE "id" = 2
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])