app/controllers/admin/rooms_controller.rb

SELECT * FROM "rooms" WHERE ("rooms"."id" = 1)
SELECT * FROM "talks" WHERE ("talks"."id" = 10)
---
  def show
    @room = Room.find(params[:id])
    @talk = Talk.find(params[:talk_id])

SELECT * FROM "rooms" WHERE ("rooms"."id" = 1)
---
  def edit
    @room = Room.find(params[:id])

SELECT * FROM "rooms" WHERE ("rooms"."id" = 1)
SELECT * FROM "talks" WHERE ("talks"."id" = 10)
UPDATE "rooms" SET "updated_at" = '2010-09-02 10:57:01', "name" = 'Sala secundaria', "capacity" = 40, "description" = 'Salón de usos múltiples' WHERE "id" = 1
---
  def update
    @room = Room.find(params[:id])
    @talk = Talk.find(params[:talk_id])
    puts params[:talk_id]
    respond_to do |format|
      if @room.update_attributes(params[:room])