app/controllers/admin/speakers_controller.rb

SELECT * FROM "speakers"
---
  def index
    @speakers = Speaker.all

SELECT * FROM "speakers" WHERE ("speakers"."id" = 11)
---
  def show
    @speaker = Speaker.find(params[:id])

SELECT * FROM "speakers" WHERE ("speakers"."id" = 1)
---
  def edit
    @speaker = Speaker.find(params[:id])

INSERT INTO "speakers" ("name", "created_at", "updated_at", "description") VALUES('luisa', '2010-08-31 07:25:00', '2010-08-31 07:25:00', 'descripcion de luisa')
---
  def create
    @speaker = Speaker.new(params[:speaker])
puts @speaker.name
    respond_to do |format|
      if @speaker.save

SELECT * FROM "speakers" WHERE ("speakers"."id" = 1)
UPDATE "speakers" SET "updated_at" = '2010-08-31 12:44:10', "description" = 'Especialista' WHERE "id" = 1
---
  def update
    @speaker = Speaker.find(params[:id])

    respond_to do |format|
      if @speaker.update_attributes(params[:speaker])