app/controllers/admin/talks_controller.rb

SELECT * FROM "talks" WHERE ("talks"."id" = 10)
---
  def show
    @talk = Talk.find(params[:id])

SELECT * FROM "talks" WHERE ("talks"."id" = 10)
---
  def edit
    @talk = Talk.find(params[:id])

SELECT * FROM "talks" WHERE ("talks"."id" = 1)
UPDATE "talks" SET "updated_at" = '2010-09-02 10:41:55', "title" = 'Hablando de...', "description" = 'hablando unpo co detodo' WHERE "id" = 1
---
  def update
    @talk = Talk.find(params[:id])

    respond_to do |format|
      if @talk.update_attributes(params[:talk])