app/controllers/events_controller.rb

  def index
    @events = Event.all
---
SELECT * FROM "events"

   def comment

      @event = Event.find(params[:format])
      comment = Comment.new(params[:comment])
      @event.add_comment comment
      comment.save!
---
SELECT * FROM "events" WHERE ("events"."id" = 0)
INSERT INTO "comments" ("created_at", "author", "body", "commentable_type", "commentable_id", "user_id", "website", "email") VALUES('2010-08-13 10:32:42', 'xasdf', 'asdfasdf', 'Event', 1, 0, 'fasdf', 'asd')