app/controllers/rooms_controller.rb

  def index
    @rooms = Room.all
---
SELECT * FROM "rooms"

  def show
    @room = Room.find(params[:id])
---
SELECT * FROM "rooms" WHERE ("rooms"."id" = 1)