app/controllers/speakers_controller.rb

  def index
    @speakers = Speaker.all
---
SELECT * FROM "speakers"

  def show
    @speaker = Speaker.find(params[:id])
---
SELECT * FROM "speakers" WHERE ("speakers"."id" = 2)