app/controllers/talks_controller.rb

  def index
    @talks = Talk.all
---
SELECT * FROM "talks"

  def show
    @talk = Talk.find(params[:id])
---
SELECT * FROM "talks" WHERE ("talks"."id" = 5) LIMIT 1

  def comment

    @talk = Talk.find(params[:format])
    comment = Comment.new(params[:comment])
    @talk.add_comment comment
    comment.save!
---
SELECT * FROM "talks" WHERE ("talks"."id" = 8)
INSERT INTO "comments" ("created_at", "author", "body", "commentable_type", "commentable_id", "user_id", "website", "email") VALUES('2010-08-19 07:49:27', 'laura', 'asf', 'Talk', 8, 0, 'ibcmass', 'laura@ibcmass.com')