app/controllers/users_controller.rb

    def update
      @user = current_user
      if @user.update_attributes(params[:user])
---
UPDATE "users" SET "persistence_token" = '82aae3fb0da39610c33c6d82e7abc80a91ff94fb53ceabab804a783b9a898ae407b738683a0ea30158906bf9255665b554ab2c5e07f0dd8a355a3f5e66142b33', "updated_at" = '2010-08-17 08:39:42', "email" = 'laura@email.es', "password_salt" = 'O7PRFLhiX06TTYSkX2P7', "crypted_password" = '2b55b90b9e58b99554cf3c907bb82696be5fc8f7d799eb68aeac4b6c23b2ff09cdbccb71a5a4982bb190b1012a0a0c33d4279923dded3fc36a044c6341d22c0b' WHERE "id" = 1

  def create
      @user= (params[:admin]) ? Admin.new(params[:user]):User.new(params[:user])

    if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "type", "persistence_token", "email") VALUES('2010-08-17 11:38:02', '6b7bb41c7ceb2e257cb604f94979af6672144b9ba85c49dc95a03d57dee83c8743e64b10f493ba2ec860e77d6d9f5ad435055c5f29d66ca3afdf16e4b8700859', '2010-08-17 11:38:02', 'maria', 'hiFnQW7NR6xCYqDogdh2', NULL, '559a6df08520fe04c03d4608101c8c79f4c393fc2b5fca3e374d3cc03ae9100a45a45c19833e725bd032a724c4bdd8f54a3baee2f1e21422f0559ef7ad632928', 'maria@gmail.com')